app/controllers/shopping_karts_controller.rb

SELECT "shopping_karts".* FROM "shopping_karts"
---
  def index
    @shopping_karts = ShoppingKart.all